# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'

brew 'git'
brew 'zsh'
brew 'zsh-completions'

# Install Binaries
# brew 'bash' # Bash 4
brew 'coreutils' # Those that come with macOS are outdated

# brew 'grep'
# brew 'mackup'
# brew 'mas'
# brew 'trash'
brew 'tree'
brew 'z'


# Web
cask 'firefox'
cask 'google-chrome'

# Development
cask 'iterm2'
cask 'atom'
brew 'vim'
# cask 'sublime-text'
# cask 'insomnia' # http client
# cask 'docker'
# cask 'java'

# General
cask 'slack'
cask 'grammarly'
cask 'vlc'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Install Mac App Store apps
# mas '1Password', id: 1333542190
# mas 'Byword', id: 420212497
# mas 'Deckset', id: 847496013
# mas 'Giphy Capture', id: 668208984
# mas 'Sip', id: 507257563
# mas 'Spark', id: 1176895641
# mas 'The Unarchiver', id: 425424353
# mas 'Things', id: 904280696
# mas 'Tweetbot', id: 1384080005
# mas 'WhatsApp', id: 1147396723
